{"id":"01g8femrav6yns3285tgwma7wf","add_time_ms":1658376053083,"icon":"book","type":"doc","_id":"14","title":"Introduction to wxWidgets","content":"　　This tutorial will introduce you to the programming with the wxWidgets toolkit.\n\n　　wxWidgets\n\n　　wxWidgets is a Graphical User Interface (GUI) toolkit for creating C++ applications. It is an open source, mature, and cross-platform toolkit. wxWidgets applications run on all major OS platforms, including Windows, Unix, and Mac OS. The project was started by Julian Smart in 1992. wxWidgets is much more than a toolkit. It provides a large variety of classes for handling streams, databases, threads, online help, or application settings. wxWidgets consists of a large group of widgets. The community around wxWidgets is grouped around their website.\n\n　　The C++ programming language\n\n　　The C++ programming language is one of the most widely used programming languages. It is used in many famous desktop applications like MS Office, Macromedia Flash, Firefox, Photoshop or 3D Max. C++ dominates also the world of PC games. It is one of the most difficult programming languages. On the other hand, programming in C++ today is different from programming 10 years ago. There are many tools and libraries that make the programming easier.\n\n　　Programming languages\n\n　　There are currently several widely used programming languages. The following list is based on the TIOBE Programming Community Index. The numbers are from September 2017. As we can see, C++ still belongs to the most popular programming languages in the world.\n\n　　Position\t    Language\t            Ratings\n\n　　1\t               Java\t                         12.7%\n\n　　2\t               C\t                           7.4%\n\n　　3\t               C++\t                         5.6%\n\n　　4\t               C#\t                          4.8%\n\n　　5\t               Python\t                   2.9%\n\n　　6\t               PHP\t                        2.2%\n\n　　7\t              JavaScript\t             2.0%\n\n　　8\t              Visual Basic .NET\t    1.98%\n\n　　9\t              Perl\t                         1.95%\n\n　　10\t          Ruby\t                      1.93%\n\n　　Java is the most widely used programming language. Java excels in creating portable mobile applications, programming various appliances and in creating enterprise applications. Every fourth application is programmed in C/C++. They are standard for creating operating systems and various desktop applications. C/C++ are the most widely used system programming languages.\n\n　　C# is the main programming language of the Microsoft .NET platform.\n\n　　PHP dominates over the Web. While Java is used mainly by large organisations, PHP is used by smaller companies and individuals. PHP is used to create dynamic web applications.\n\n　　Visual Basic .NET is another popular .NET programming language. It represents the popularity of the RAD (Rapid Application Development).\n\n　　Perl, Python, and Ruby are the most widely used scripting languages. They share many similarities. They are close competitors.\n\n　　Multiplatform programming\n\n　　Today, multiplatform programming is a buzzword. Most languages and libraries want to be multiplatform. wxWidgets was created as a multiplatform tool from the beginning. Most developers choose among these options. If it is possible, they go to the web. Or they can use Qt, wxWidgets, Swing, or SWT. The Qt library is the closest competitor to wxWidgets.\n\n　　Installing wxWidgets\n\n　　The following instructions are valid for Debian-based Linux.\n\n　　$ sudo apt-get install build-essential\n\n　　If we do not have a C++ compiler yet, we install the build-essential package.\n\n　　$ sudo apt-get install libwxgtk3.0-dev\n\n　　This installs the wxWidgets package.\n\n　　This was an introduction to wxWidgets.","edit_time_ms":1658376663696,"snapshots":[]}